test/fixtures/acs/autonomoustransfercomplete1

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cwmp="urn:dslforum-org:cwmp-1-4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">API_69412286f02e475b44783c61972f0a91</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <cwmp:AutonomousTransferComplete>
      <AnnounceURL>http://example.com/announce</AnnounceURL>
      <TransferURL>http://example.com/transfer</TransferURL>
      <IsDownload>1</IsDownload>
      <FileType>1 Firmware Upgrade Image</FileType>
      <FileSize>154321</FileSize>
      <TargetFileName>image</TargetFileName>
      <FaultStruct>
        <FaultCode>0</FaultCode>
        <FaultString></FaultString>
      </FaultStruct>
      <StartTime>2015-01-19T23:08:24+00:00</StartTime>
      <CompleteTime>2015-01-19T23:18:24+00:00</CompleteTime>
    </cwmp:AutonomousTransferComplete>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
